Revit 2017 API
RevolvedSurface Properties
The RevolvedSurface type exposes the following members.
Properties
Name | Description
Axis
 Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Surface.)
Origin
 Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface.
XDir
 X axis of the local coordinate system associated with this revolved surface.
YDir
 X axis of the local coordinate system associated with this revolved surface.
See Also
RevolvedSurface Class
Autodesk.Revit.DB Namespace